In [28]:
import sqlite3

In [ ]:
C:\Users\HPW>cd /d E:\QuantLake

In [ ]:
E:\QuantLake>sqlite3 chinook.db

# TASK-1

In [ ]:
SELECT * FROM customers

In [ ]:
SELECT * FROM customers
WHERE Country='USA' AND CustomerId>10;

In [ ]:
SELECT * FROM customers
WHERE Country = 'USA' OR Country = 'Canada';

In [ ]:
SELECT * FROM invoices
WHERE Total<5;

In [ ]:
SELECT * FROM customers
WHERE Country !='USA';

# TASK-2

In [ ]:
SELECT BillingCountry, COUNT(*) AS NumInvoices, AVG(Total) AS AvgAmount
   ...> FROM invoices
   ...> WHERE Total > 10
   ...> GROUP BY BillingCountry;

In [ ]:
sqlite> SELECT Name
   ...> FROM tracks
   ...> WHERE AlbumId IN (
(x1...>     SELECT AlbumId
(x1...>     FROM albums
(x1...>     WHERE ArtistId IN (
(x2...>         SELECT ArtistId
(x2...>         FROM artists
(x2...>         WHERE Name = 'Queen'
(x2...>     )
(x1...> );

In [ ]:
sqlite> SELECT Title
   ...> FROM albums
   ...> WHERE AlbumId IN (
(x1...>     SELECT AlbumId
(x1...>     FROM tracks
(x1...>     GROUP BY AlbumId
(x1...>     HAVING COUNT(*) > 10
(x1...> );

In [ ]:
sqlite> SELECT Name
   ...> FROM artists
   ...> WHERE ArtistId IN (
(x1...>     SELECT ArtistId
(x1...>     FROM albums
(x1...>     WHERE AlbumId IN (
(x2...>         SELECT AlbumId
(x2...>         FROM tracks
(x2...>         WHERE GenreId = (
(x3...>             SELECT GenreId FROM genres WHERE Name = 'Rock'
(x3...>         )
(x2...>     )
(x1...> );

In [ ]:
sqlite> SELECT Name
   ...> FROM playlists
   ...> WHERE PlaylistId IN (
(x1...>     SELECT PlaylistId
(x1...>     FROM playlist_track
(x1...>     WHERE TrackId = (
(x2...>         SELECT TrackId FROM tracks WHERE Name = 'Smells Like Teen Spirit'
(x2...>     )
(x1...> );

In [ ]:
sqlite> SELECT FirstName, LastName
   ...> FROM employees
   ...> WHERE EmployeeId IN (
(x1...>     SELECT ReportsTo FROM employees WHERE ReportsTo IS NOT NULL
(x1...> );

# TASK-3

In [ ]:
import pandas as pd

In [13]:
# Connect to your SQLite database
conn = sqlite3.connect('E:/QuantLake/chinook.db')

In [14]:
# Example: Query invoices where total > 15
query = """
SELECT InvoiceId, CustomerId, BillingCountry, Total
FROM invoices
WHERE Total > 15
"""

In [15]:
# Execute the SQL query and load the result into a DataFrame
df = pd.read_sql_query(query, conn)

In [16]:
# Explore the DataFrame
print("First 5 rows:")
df.head()

First 5 rows:

   InvoiceId  CustomerId BillingCountry  Total
0         88          57          Chile  17.91
1         89           7        Austria  18.86
2         96          45        Hungary  21.86
3        103          24            USA  15.86
4        194          46        Ireland  21.86

In [17]:
df.isnull().sum()

InvoiceId         0
CustomerId        0
BillingCountry    0
Total             0
dtype: int64

In [18]:
query1 = """
SELECT Name, Milliseconds
FROM tracks
WHERE Milliseconds > 300000
"""

In [19]:
df = pd.read_sql_query(query1, conn)

In [20]:
df

                                                   Name  Milliseconds
0               For Those About To Rock (We Salute You)        343719
1                                     Balls to the Wall        342562
2                                  Princess of the Dawn        375418
3                                               Go Down        331180
4                                     Let There Be Rock        366654
...                                                 ...           ...
1064                                   Act IV, Symphony        364296
1065  3 Gymnopédies: No.1 - Lent Et Grave, No.3 - Le...        385506
1066                Symphony No. 2: III. Allegro vivace        376510
1067                           Metopes, Op. 29: Calypso        333669
1068  Concerto for Violin, Strings and Continuo in G...        493573

[1069 rows x 2 columns]

# TASK-4

In [ ]:
UPDATE customers
SET Country='India'
WHERE Country IS NULL;

In [ ]:
SELECT CustomerId, FirstName, LastName, Country
FROM customers
WHERE Country = 'India';

In [ ]:
DELETE FROM invoices
WHERE Total < 1;

In [ ]:
SELECT * FROM invoices
WHERE Total < 1;

# TASK-5

In [21]:
customers_df = pd.read_sql_query("SELECT CustomerId, FirstName, Country FROM customers", conn)

In [22]:
invoices_df = pd.read_sql_query("SELECT InvoiceId, CustomerId, Total FROM invoices", conn)

In [23]:
# Performing INNER JOIN on CustomerId
merged_df = pd.merge(customers_df, invoices_df, on='CustomerId', how='inner')

In [24]:
merged_df

     CustomerId FirstName Country  InvoiceId  Total
0             1      Luís  Brazil         98   3.98
1             1      Luís  Brazil        121   3.96
2             1      Luís  Brazil        143   5.94
3             1      Luís  Brazil        316   1.98
4             1      Luís  Brazil        327  13.86
..          ...       ...     ...        ...    ...
352          59      Puja   India         45   5.94
353          59      Puja   India         97   1.99
354          59      Puja   India        218   1.98
355          59      Puja   India        229  13.86
356          59      Puja   India        284   8.91

[357 rows x 5 columns]

In [25]:
invoice_items_df = pd.read_sql_query("SELECT InvoiceLineId, InvoiceId, TrackId, UnitPrice, Quantity FROM invoice_items", conn)
tracks_df = pd.read_sql_query("SELECT TrackId, Name AS TrackName, GenreId FROM tracks", conn)

In [26]:
# Merged on TrackId
merged_tracks_df = pd.merge(invoice_items_df, tracks_df, on='TrackId', how='inner')

In [27]:
merged_tracks_df

,InvoiceLineId,InvoiceId,TrackId,UnitPrice,Quantity,TrackName,GenreId
0,1,1,2,0.99,1,Balls to the Wall,1
1,2,1,4,0.99,1,Restless and Wild,1
2,3,2,6,0.99,1,Put The Finger On You,1
3,4,2,8,0.99,1,Inject The Venom,1
4,5,2,10,0.99,1,Evil Walks,1
...,...,...,...,...,...,...,...
2235,2236,411,3136,0.99,1,Looking For Love,3
2236,2237,411,3145,0.99,1,Sweet Lady Luck,3
2237,2238,411,3154,0.99,1,Feirinha da Pavuna/Luz do Repente/Bagaço da La...,7
2238,2239,411,3163,0.99,1,Samba pras moças,7
2239,2240,412,3177,1.99,1,Hot Girl,19